{
    "_class_name": "SanaTransformer2DModel",
    "_diffusers_version": "0.32.0.dev0",
    "attention_bias": false,
    "attention_head_dim": 32,
    "caption_channels": 2304,
    "cross_attention_dim": 768,
    "cross_attention_head_dim": 72,
    "dropout": 0.0,
    "in_channels": 32,
    "mlp_ratio": 2.5,
    "norm_elementwise_affine": false,
    "norm_eps": 1e-06,
    "num_attention_heads": 16,
    "num_cross_attention_heads": 16,
    "num_layers": 20,
    "out_channels": 32,
    "patch_size": 1,
    "sample_size": 16
}